-- Создать таблицу friends с помощью subquery так, чтобы она после
-- создания содержала значения следующих столбцов из таблицы
-- employees: employee_id, first_name, last_name для тех строк, где
-- имеются комиссионные. Столбцы в таблице friends должны называться
-- id, name, surname

-- Добавить в таблицу friends новый столбец email

-- Изменить столбец email так, чтобы его значение по умолчанию было «no email».

-- Проверить добавлением новой строки, работает ли дефолтное
-- значение столбца email.

-- Изменить название столбца с id на friends_id

-- Удалить таблицу friends.

-- Создать таблицу friends со следующими столбцами: id, name, surname,
-- email, salary, city, birthday. У столбцов salary и birthday должны быть
-- значения по умолчанию.

-- Добавить 1 строку в таблицу friends со всеми значениями.

-- Добавить 1 строку в таблицу friends со всеми значениями кроме salary
-- и birthday.

-- Совершить commit.

-- Удалить столбец salary.

-- Сделать столбец email неиспользуемым (unused).

-- Сделать столбец birthday неиспользуемым (unused).

-- Удалить из таблицы friends неиспользуемые столбцы.

-- Сделать таблицу friends пригодной только для чтения.

-- Проверить предыдущее действие любой DML командой.

-- Опустошить таблицу friends.

-- Удалить таблицу friends.