-- Выведите информацию о регионах и количестве сотрудников в каждом регионе.

-- Выведите детальную информацию о каждом сотруднике: имя,
-- фамилия, название департамента, job_id, адрес, страна и регион.

-- Выведите информацию о имени менеджеров которые имеют в
-- подчинении больше 6ти сотрудников, а также выведите количество
-- сотрудников, которые им подчиняются.

-- Выведите информацию о названии всех департаментов и о количестве
-- работников, если в департаменте работают больше 30ти сотрудников.
-- Используйте технологию «USING» для объединения по id
-- департамента.

-- Выведите названия всех департаментов, в которых нет ни одного сотрудника.

-- Выведите всю информацию о сотрудниках, менеджеры которых
-- устроились на работу в 2005ом году, но при это сами работники
-- устроились на работу до 2005 года.

-- Выведите название страны и название региона этой страны, используя natural join.

-- Выведите имена, фамилии и з/п сотрудников, которые получают
-- меньше, чем (минимальная з/п по их специальности + 1000).

-- Выведите уникальные имена и фамилии сотрудников, названия стран,
-- в которых они работают. Также выведите информацию о сотрудниках,
-- о странах которых нет информации. А также выведите все страны, в
-- которых нет сотрудников компании.

-- Выведите имена и фамилии всех сотрудников, а также названия стран,
-- которые мы получаем при объединении работников со всеми
-- странами без какой-либо логики.

-- Решите задачу (Выведите информацию о регионах и количестве сотрудников в каждом регионе.)
-- используя Oracle Join синтаксис.

-- Решите задачу (Выведите названия всех департаментов, в которых нет ни одного сотрудника. ),
-- используя Oracle Join синтаксис.